Week_10/W10D1/rails_olympics_production_A_skeleton/build_rails_project_pt2/BlogApp/app/controllers/blogs_controller.rb

    def create
        @blog = Blog.new(blog_params)
        if @blog.save
---
INSERT INTO "blogs" ("title", "author_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "saddassad"], ["author_id", 1], ["body", "sdaadsdsasda"], ["created_at", "2019-09-20 23:06:21.734593"], ["updated_at", "2019-09-20 23:06:21.734593"]]

    def destroy
        @blog = Blog.find(params[:id])
        @blog.delete
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 72], ["LIMIT", 1]]
DELETE FROM "blogs" WHERE "blogs"."id" = $1  [["id", 72]]