Week_10/W10D1/rails_olympics_production_A_skeleton/build_rails_project_pt2/BlogApp/app/controllers/users_controller.rb

    def create
        @user = User.new(user_params)
        if @user.save
---
INSERT INTO "users" ("email", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["email", "blah@blah.com"], ["created_at", "2019-09-20 23:05:19.955365"], ["updated_at", "2019-09-20 23:05:19.955365"]]